import pandas as pd
import os
from glob import glob
import re


FOLDER = "parsed_data"


name_mapping = {
    "1603.01.05.06.1.24/ 30.04.25": "зерно",
    "1603.01.05.06.1.24/290125": "зерно",
    "1603.01.05.07.1.24 / 30.04.25": "корнаж",
    "1603.01.05.07.1.24/290125": "корнаж",
    "1603.02.05.02.1.24 / 30.04.25": "силос",
    "1603.02.05.02.1.24/29.01.20": "силос",
    "1603.02.15.04.1.24/301024": "солома",
    "1603.03.01.01.1.24/290125": "сенаж",
    "1603.05.01.01.1.24 / 29.05.25": "сенаж",
    "1630.01.12.01.1.24/27.02.25": "сенаж",
    "1630.02.01.01.1.24/27.02.25": "сенаж",
    "1630.03.01.01.1.24/01.07.25": "сенаж",
    "1630.07.02.01.1.24/01.07.25": "сенаж",
    "1630.10.05.02.1.23/01.07.25": "силос",
    "1630.14.05.02.1.23/27.02.25": "силос",
    "1630.17.05.07.1.24/01.07.25": "корнаж",
    "1630.17.05.07.1.24/27.02.25": "корнаж",
    "2221.02.05.02.1.23 Силос": "силос",
    "2531.01.01.01.2.24 / 09.01.25": "сенаж",
    "2531.01.01.01.2.24 /03.05.25": "сенаж",
    "2531.04.05.02.1.24 / 09.01.25": "силос",
    "2531.05.05.02.1.23 / 13.03.2024": "силос",
    "2531.05.05.02.1.24 / 03.05.25": "силос",
    "3635.01.01.01.1.23 / 13.03.2024": "сенаж",
    "3635.01.01.01.1.24 / 05.06.25": "сенаж",
    "3635.05.05.02.1.24 /05.06.24": "силос",
    "3635.05.05.02.1.24 /05.06.24 31,900": "силос",
    "3638.02.01.01.2.24 / 09.01.25": "сенаж",
    "3638.02.01.01.3.24 CP 38,200": "сенаж",
    "3638.04.05.02.1.23 / 09.01.25": "силос",
    "3645.01.05.2.123 / 10.01.2024": "концентраты",
    "3645.01.10.01.1.23 / 10.02.2024": "сенаж",
    "3645.01.10.01.1.23 / 15.02.2024": "сенаж",
    "3645.02.01.01.02.24 /11.06.25": "сенаж",
    "5001.01.01.01.1.23/20.05.25": "сенаж",
    "5001.02.16.01.1.23/18.06.25": "сенаж",
    "5100.01.05.02.1.24 / 17.12.24": "силос",
    "5100.01.05.02.1.24/20.05.25v2": "силос",
    "5100.01.05.07.1.24/18.06.25": "корнаж",
    "5100.01.05.07.1.24/20.05.25": "корнаж",
    "5100.01.10.01.1.24 /24.01.25": "сенаж",
    "5100.01.10.01.1.24/18.06.25": "сенаж",
    "5100.01.10.01.1.24/22.04.25": "сенаж",
    "5210.03.03.01.1.24 /23.05.2025": "сенаж",
    "5210.07.05.02.1.24 /23.05.2025": "силос",
    "5701.01.01.01.1.24 /20.01.25": "сенаж",
    "5701.01.01.01.1.25/18.06.25": "сенаж",
    "5701.01.05.07.1.24/18.04.25": "корнаж",
    "5701.01.05.1.23 /19.09.2024": "кукуруза",
    "5701.02.05.02.1.24 /18.11.24": "силос",
    "5701.02.05.02.1.24/20.05.25": "силос",
    "5701.03.05.02.1.24 /20.01.25": "силос",
    "5701.04.01.01.3.24 /15.11.24": "сенаж",
    "5701.04.05.07.1.24 / 20.01.25": "корнаж",
    "6101.08.06.02.1.24/13.11.24": "зерно",
    "6110.01.01.01.1.24 люцерна": "сенаж",
    "6110.06.18.01.1.24/01.05.25": "сенаж",
    "6110.09.05.02.1.24/29.04.25": "силос",
    "6110.10.18.01.1.24 / 02.07.25": "сенаж",
    "6601.07.06.01.1.24 /": "сенаж",
    "6601.25.01.01.2.24 /": "сенаж",
    "6601.40.05.02.1.24/03.03.25": "силос",
    "6601.48.05.06.1.24 /": "зерно",
    "6601.49.05.07.1.24 /": "корнаж",
    "C-C 2261.03.05.02.1.23 / 14.01.25": "силос",
    "c-c 4029.04.05.02.1.23": "силос",
    "c-ж 6204.01.12.01.1.24": "сенаж",
    "Добавка ЛЕД ЭНАПКХ": "концентраты",
    "Дробина сухая. 27%, пивная,": "ячмень",
    "Дробленая солома КН Восток": "солома",
    "Дрожжи кормовые. СП 37%": "концентраты",
    "Дрожжи кормовые. СП 37%.": "концентраты",
    "Жир защищений. 99%,": "концентраты",
    "Жир защищенный. 99%": "концентраты",
    "Жир защищенный. 99%,": "концентраты",
    "Жир защищенный. 99%, гидроген. ЭНАПКХ": "концентраты",
    "Жир защищеный. 99%": "концентраты",
    "Жир защищеный. 99%,": "концентраты",
    "Жир защищеный. 99%, фракц.,ЭНАПКХ": "концентраты",
    "Жмых льняной. 36%, ЭНАПКХ": "лен",
    "Жмых рапсовый СП 39, ЭНАПКХ": "рапс",
    "Жмых рапсовый. 35%": "рапс",
    "Жмых рапсовый. 36%": "рапс",
    "Жмых рапсовый. 36%, ЭНАПКХ": "рапс",
    "Жмых рапсовый. 39%": "рапс",
    "Жмых рапсовый. 39%, ЭНАПКХ": "рапс",
    "Жом световничный сухой. гр.": "свекла",
    "Жом свекловичный сухой.": "свекла",
    "Жом свекловичный сухой. гр": "свекла",
    "Жом свекловичный сухой. гр,": "свекла",
    "Жом свекловичный сухой. гр, ЭНАПКХ v2": "свекла",
    "Жом свекловичный сухой. гранула, ЭНАПКХ": "свекла",
    "Жом свеклосуш. сухой, гр.": "свекла",
    "ЗСК 6201.05.05.07.1.22": "корнаж",
    "ЗСК 6202.05.05.07.1.23": "корнаж",
    "ЗСК 6202.05.05.07.1.23 03.02.2025 (Res#1) MA": "корнаж",
    "КК 10 Аристово 11.03.25": "комбикорм",
    "КК 10 От 03.01.24": "комбикорм",
    "КК 10 От 17.09.24 ячмень": "комбикорм",
    "КК №10": "комбикорм",
    "КК10": "комбикорм",
    "КК10/03.05.25": "комбикорм",
    "ККД10 Аристово/12.04.24": "комбикорм",
    "ККД10 Аристово/12.04.25": "комбикорм",
    "Кальций пропионат.": "концентраты",
    "Комбиком №10 / 24.10.2024": "комбикорм",
    "Комбиком №13 / 24.10.2024": "комбикорм",
    "Комбикорм - 11/14.02.2024_Жом": "комбикорм",
    "Комбикорм 10.3.3 (без пшен.)": "комбикорм",
    "Комбикорм 10.3.3 (без пшен.) _Сентябрь 09.09.24": "комбикорм",
    "Комбикорм 10.3.3_Январь": "комбикорм",
    "Комбикорм 11 группы (Д1)": "комбикорм",
    "Комбикорм 11 группы (Д1) от *": "комбикорм",
    "Комбикорм 11.3.3 (без пшен.)": "комбикорм",
    "Комбикорм 11.3.3 (без пшен.) _Сентябрь 09.09.24": "комбикорм",
    "Комбикорм 11.3.3 (без пшен.) _Сентябрь 12.03.25": "комбикорм",
    "Комбикорм 11.3.3_Январь": "комбикорм",
    "Комбикорм №11 ЭНАС": "комбикорм",
    "Комбикорм №11/ 31.10.2024": "комбикорм",
    "Кормосмесь 10": "комбикорм",
    "Корнаж 2371.06.05.07.1.23 -": "корнаж",
    "Корнаж 2501.08.05.07.1.23 -": "корнаж",
    "Корнаж 2501.09.05.07.1.23 -": "корнаж",
    "карнаж6601.49.05.07.1.24.15.07": "корнаж",
    "Кукуруза. 70% сухая среди.": "кукуруза",
    "Кукуруза 70%, сухая соедин.": "кукуруза",
    "Кукуруза влажная, кр. 68%": "кукуруза",
    "Кукуруза влажная, кр. 68%,": "кукуруза",
    "Кукуруза. 65%,сухая средн.": "кукуруза",
    "Кукуруза. 65%,сухая средн. помол": "кукуруза",
    "Кукуруза. 70%,сухая средн.": "кукуруза",
    "Кукуруза. 70%,сухая средн. помол, ЭНАПКХ": "кукуруза",
    "Кукуруза. 70%,сухая, мелк.": "кукуруза",
    "Кукуруза. 70%,сухая, мелк. помол": "кукуруза",
    "Кукуруза. 70%,сухая, мелк. помол,": "кукуруза",
    "Кукуруза. 70%,сухая, мелк. помол, ЭНАПКХ": "кукуруза",
    "кукуруза6601.40.05.02.1.24.15.0": "кукуруза",
    "плющенное6601.48.05.06.1.24.": "кукуруза",
    "Люцерна 2501.03.01.01.2.24": "сенаж",
    "люцерна6601.29.08.01.1.24.15.": "сенаж",
    "Люцерна 2501.04.08.01.1.24": "сенаж",
    "Люцерна 3637.01.01.01.1.24": "сенаж",
    "Люцерна 3637.01.01.01.1.24 -": "сенаж",
    "Люцерна 3637.03.01.01.2.23 -": "сенаж",
    "Люцерна 3637.03.01.01.2.24 -": "сенаж",
    "Люцерна 3637.04.01.01.3.24": "сенаж",
    "Люцерна 3637.04.01.01.3.24 -": "сенаж",
    "Люцерна2371.01.01.01.2.24 -": "сенаж",
    "Мел. ЭНАПКХ": "концентраты",
    "Меласса свекловичная / патока": "свекла",
    "Меласса свекловичная /патока": "свекла",
    "Патока световничная, сахар": "свекла",
    "Патока свекловичная": "свекла",
    "Патока свекловичная, сах.49%": "свекла",
    "Патока свекловичная, сах.49%,": "свекла",
    "Патока свекловичная, сах.49%,  ЭНАПКХ": "свекла",
    "Патока свекловичная, сах.49%,  ЭНАПКХ v2": "свекла",
    "Патока свекловичная, сах.49%, ЭНАПКХ": "свекла",
    "Патока свекловичная, сах.49%, ЭНАПКХ v": "свекла",
    "Патока свекловичная, сах.49%, ЭНАПКХ v2": "свекла",
    "Патока свекловичная, сахар": "свекла",
    "Патока свекловичная, сахар 55%": "свекла",
    "Патока свекловичная, сахар 55%,": "свекла",
    "Патока свекловичная, сахар 55%,  ЭНАПКХ": "свекла",
    "Патока свекловичная, сахар 55%, ЭНАПКХ": "свекла",
    "Патока свеклочная, сах.49%": "свекла",
    "Пивные дрожжи сухие": "концентраты",
    "Плющ зерно 6203.06.05.06.1.24 03.02.25": "зерно",
    "Плющенная кукуруза ток1": "кукуруза",
    "Поташ. ЭНАПКХ": "концентраты",
    "Премикс Транзит Б. 07.23": "концентраты",
    "Премикс дойный А. 12.23 ЭНАПКХ": "концентраты",
    "Премикс дойный Б. 07.23": "концентраты",
    "Премикс дойный Б. 07.23 ЭНАПКХ": "концентраты",
    "Премикс дойный Б. 09.22": "концентраты",
    "Пшеница. 55%, сухая.средн.": "пшеница",
    "Пшеница. 55%, сухая.средн. помол": "пшеница",
    "Пшеница. 55%, сухая.средн. помол, ЭНАПКХ": "пшеница",
    "Пшеница. 55%, сухая.среди.": "пшеница",
    "Пшеничная солома": "солома",
    "С-Ж 2241.02.04.01.1.24/ СР": "сенаж",
    "С-Ж 2241.03.04.01.1.23 / 05.01.25": "сенаж",
    "С-Ж 2242.01.04.01.1.23\\": "сенаж",
    "С-Ж 2242.02.01.01.1.24 / 05.01.25": "сенаж",
    "С-Ж 2242.02.08.01.1.24 \\ 12.03.25": "сенаж",
    "С-Ж 2242.02.08.01.1.24/14.06.25": "сенаж",
    "С-Ж 2242.03.08.01.2.23\\": "сенаж",
    "С-Ж 2262.01.01.01.1.24 / 05.01.25": "сенаж",
    "С-Ж 2262.01.01.01.1.24 \\ 12.03.25": "сенаж",
    "С-Ж 2262.03.01.01.2.24/14.06.25": "сенаж",
    "С-Ж 2262.05.10.01.1.24 / 05.01.25": "сенаж",
    "С-Ж 2262.05.10.01.1.24 \\ 12.03.25": "сенаж",
    "С-Ж 2262.08.08.01.2.24 /  14.06.24": "сенаж",
    "С-Ж 2392.01.01.01.1.24 / СР": "сенаж",
    "С-Ж 2392.01.01.01.1.24 \\ 12.03.25": "сенаж",
    "С-Ж 2392.01.01.01.1.24/14.06.25": "сенаж",
    "С-Ж 2392.04.10.01.2.24 \\ 12.03.25": "сенаж",
    "С-Ж 2392.04.10.01.2.24/14.06.25": "сенаж",
    "С-С 2241.04.05.02.1.24 СР": "силос",
    "С-С 2242.01.05.02.1.24 / 05.01.25": "силос",
    "С-С 2242.03.05.02.1.24 \\ 12.03.25": "силос",
    "С-С 2242.03.05.02.1.24/14.06.25": "силос",
    "С-С 2242.05.05.02.1.23\\ 11.04.24": "силос",
    "С-С 2261.04.05.02.1.23 \\ 12.03.25": "силос",
    "С-С 2262.04.05.02.1.24 / СР": "силос",
    "С-С 2262.04.05.02.1.24/14.06.25": "силос",
    "С-С 2392.05.05.02.1.24/14.06.25": "силос",
    "С-С 2392.07.05.02.1.24 \\ 12.03.25": "силос",
    "С-ж 4019.02.09.01.2.24 Косово- клевер/26.09.24": "сенаж",
    "С-ж 4019.02.09.01.2.24 Косово1/1.07.2025": "сенаж",
    "С-ж 4029.01.01.01.1.25 Уланово/1.07.2025": "сенаж",
    "С-ж 4032.01.01.01.1.25 Гусево/1.07.2025": "сенаж",
    "С-ж 5701.01.01.01.1.24 Бушовка/22.04.25": "сенаж",
    "С-ж 6201.07.01.01.1.24": "сенаж",
    "С-ж 6202.02.01.01.1.24 03.02.25": "сенаж",
    "С-с 4029.01.05.02.1.24 Уланово22.04.25": "силос",
    "С-с 6201.10.05.02.1.23": "силос",
    "С-с 6203.05.05.02.1.24": "силос",
    "Сенаж": "сенаж",
    "Сенаж 22.02.01.01.01.1.24 /": "сенаж",
    "Сенаж 2201.02.01.01.2.24": "сенаж",
    "Сенаж 2201.02.01.01.2.24 /": "сенаж",
    "Сенаж 2211.02.01.01.2.24": "сенаж",
    "Сенаж 2221.02.08.01.1.24 /": "сенаж",
    "Сенаж 2232.02.08.01.2.24 /": "сенаж",
    "Сенаж 2291.01.01.01.2.24 /": "сенаж",
    "Сенаж 2291.02.01.01.3.24 /": "сенаж",
    "Сено из люцерны": "сено",
    "Сено луговое 2024 / 14.09.2024": "сено",
    "Сено луговое ЛБ": "сено",
    "Сено люцерна ЛБ 2025": "сено",
    "Силос 22.02.02.05.02.1.24 /": "силос",
    "Силос 2201.03.05.02.1.24": "силос",
    "Силос 2201.03.05.02.1.24 /": "силос",
    "Силос 2211.03.05.02.1.24": "силос",
    "Силос 2221.03.05.02.1.24 /": "силос",
    "Силос 2232.03.05.02.1.24 /": "силос",
    "Силос 2291.03.05.02.1.24 /": "силос",
    "Силос 2291.04.05.02.1.24 /": "силос",
    "Силос 2371.04.05.02.1.24 -": "силос",
    "Силос 2371.05.05.02.1.23 -": "силос",
    "Силос 2501.05.05.02.1.24": "силос",
    "Силос 3636.07.05.02.1.24": "силос",
    "Силос 3636.07.05.02.1.24 -": "силос",
    "Силос 3637.05.05.02.1.23": "силос",
    "Силос 3637.06.05.02.1.23 -": "силос",
    "Силос 3637.07.05.02.1.24 -": "силос",
    "Сода. ЭНАПКХ": "концентраты",
    "Соевая оболочка ЭНАПКХ": "соя",
    "Солома": "солома",
    "Солома ЭНА Восточное": "солома",
    "Солома ЭНА Восточное -": "солома",
    "Солома пшеничная 2024": "солома",
    "Солома пшеничная 2024 /": "солома",
    "Солома пшеничная ЛБ": "солома",
    "Солома-пшеничная ОМ Север": "солома",
    "Соль. ЭНАПКХ": "концентраты",
    "Сорго, 68%, сухое, ср. помол": "сорго",
    "Тритикале 2501.02.12.01.1.24": "сенаж",
    "Тритикале 3636.01.12.01.1.24": "сенаж",
    "Тритикале 3636.01.12.01.1.24 -": "сенаж",
    "Тритикале 3637.01.12.01.1.23 -": "сенаж",
    "Тритикале 3637.02.12.01.1.24": "сенаж",
    "Шрот Рапсовый": "рапс",
    "Шрот подсолнечный. 38%": "подсолнечник",
    "Шрот рапсовый, 41%, ЭНАПКХ": "рапс",
    "Шрот рапсовый. 38%": "рапс",
    "Шрот рапсовый. 38%,": "рапс",
    "Шрот рапсовый. 38%, ЭНАПКХ": "рапс",
    "Шрот рапсовый. 41%": "рапс",
    "Шрот рапсовый. 41%, ЭНАПКХ": "рапс",
    "Шрот рапсовый. 42%": "рапс",
    "Шрот рапсовый. 44%, ЭНАПКХ": "рапс",
    "Шрот соевый, 49%, ЭНАПКХ": "соя",
    "Шрот соевый. 47%, ЭНАПКХ": "соя",
    "Шрот соевый. 49%, ЭНАПКХ": "соя",
    "Шрот соевый. 51%, ЭНАПКХ": "соя",
    "Шрот соевый. 52%, ЭНАПКХ": "соя",
    "Ячмень. сухой 53%, средний": "ячмень",
    "Ячмень. сухой 53%, средний помол,": "ячмень",
    "Ячмень. сухой 53%, средний помол, ЭНАПКХ": "ячмень",
    "Ячмень.60%, сухой, средний": "ячмень",
    "Ячмень.60%, сухой, средний помол,": "ячмень",
    "Ячмень.61%, сухой, средний": "ячмень",
    "Ячмень.61%, сухой, средний помол, ЭНАПКХ": "ячмень",
    "к-ж 17.04\\5204.01.05.07.1.24 Болдасовка": "корнаж",
    "к-ж 23.12.24\\5204.01.05.07.1.24 Болдасовка": "корнаж",
    "к-ж 6204.01.05.07.1.24": "корнаж",
    "к-ж 6204.02.05.07.1.23": "корнаж",
    "к-ж 8.05.25\\5204.01.05.07.1.24 Болдасовка": "корнаж",
    "к-ж Детч 4030.02.05.07.1.24_04.04.2025": "корнаж",
    "к-ж4030.05.05.07.1.24 Детчино 25.06.25": "корнаж",
    "к-ж5701.05.07.1.23 Бушовка": "корнаж",
    "ккз аристово v4": "концентраты",
    "корнаж": "корнаж",
    "корнаж_9202.03.05.07.1.23/24.0": "корнаж",
    "кукуруза_плющ_9202.01.05.06.": "кукуруза",
    "люц_9202.04.01.01.1.24/24.02.2": "сенаж",
    "люцерна_9202.04.01.01.1.24\\06": "сенаж",
    "однолетние травы/3645.01.10.01.1.24/10.05.25": "сенаж",
    "плющенная кукуруза": "кукуруза",
    "пшеница_консерв_СНБ/07.10.2": "пшеница",
    "рожь_9202.02.13.01.1.24/05.03.": "сенаж",
    "с-": "сенаж",
    "с-ж": "сенаж",
    "с-ж 17.04\\5902.01.01.01.1.24 Сугоново": "сенаж",
    "с-ж 21.03.25/5204.02.01.01.2.24 Болдасовка": "сенаж",
    "с-ж 21.03.25\\4030.06.01.01.1.24 Детчино": "сенаж",
    "с-ж 21.03.25\\5110.01.08.01.1.24 Дурово": "сенаж",
    "с-ж 21.03.25\\5313.02.01.01.2.24": "сенаж",
    "с-ж 22.08.24\\4030.11.01.01.2.24 Санталовка": "сенаж",
    "с-ж 6204.01.12.01.1.24": "сенаж",
    "с-ж 6204.06.01.01.2.24": "сенаж",
    "с-ж 8.05.25\\5110.01.08.01.1.24 Дурово": "сенаж",
    "с-ж 8.05.25\\5313.03.01.01.3.24 Поливаново": "сенаж",
    "с-ж4029.09.01.01.3.23": "сенаж",
    "с-с  23.06.2025\\4030.01.05.02.1.24 Прудки": "силос",
    "с-с 17.04\\5901.01.05.02.1.24 Аристово": "силос",
    "с-с 21.03.25\\5204.01.05.02.1.24 Болдасовка": "силос",
    "с-с 23.06.2025\\5901.01.05.02.1.24.Аристово": "силос",
    "с-с 25.03.25\\5901.01.05.02.1.24 Аристово": "силос",
    "с-с 27.02.25\\4030.01.05.02.1.24 Прудки": "силос",
    "с-с 4029.03.05.02.1.23": "силос",
    "с-с 6204.01.05.02.1.24": "силос",
    "силос 9202.04.05.02.1.24/06.06": "силос",
    "силос/3645.04.05.02.1.24/20.05.25": "силос",
    "силос9202.01.05.02.1.24/06.06.": "силос",
    "силос_9202.04.05.02.1.24/28.01": "силос",
    "солома": "солома",
    "солома ячменная": "солома",
    "солома6601.24.15.04.1.24.15.07": "солома",
    "суданка6601.30.06.01.2.24.15.0": "сенаж"
}

uniq_ration = ['кукуруза', 'ячмень', 'лен', 'соя', 'концентраты', 'свекла', 'зерно', 'сенаж', 'солома', 'комбикорм', 'рапс', 'силос', 'корнаж', 'пшеница', 'сено', 'подсолнечник', 'сорго']
uniq_changed_ration = ['кукуруза', 'ячмень', 'лен', 'соя', 'концентраты', 'свекла', 'суданская трава', 'зерносмесь', 'солома', 'луговые травы', 'люцерна', 'комбикорм', 'рапс', 'однолетние травы', 'многолетние травы', 'пшеница', 'тритикале', 'эспарцет', 'сенаж', 'корнаж', 'клевер', 'сено', 'разнотравье', 'подсолнечник', 'сорго', 'силос', 'рожь']
uniq_step = ['K (%)', 'aNDFom фуража (%)', 'СЖ (%)', 'CHO B3 медленная фракция (%)', 'Растворимая клетчатка (%)', 'Крахмал (%)', 'peNDF (%)', 'aNDFom (%)', 'ЧЭЛ 3x NRC (МДжоуль/кг)', 'CHO B3 pdNDF (%)', 'Сахар (ВРУ) (%)', 'НСУ (%)', 'ОЖК (%)', 'НВУ (%)', 'CHO C uNDF (%)', 'СП (%)', 'RD Крахмал 3xУровень 1 (%)']

csv_files = glob(os.path.join(FOLDER, "*.csv"))

def get_unique_ration_elems(mapping):
    unique_values = dict()

    for file in csv_files:
        try:
            df = pd.read_csv(file, sep="|")
        except Exception as e:
            print(f"⚠️ Не удалось прочитать {file}: {e}")
            continue

        if "Ингредиенты" not in df.columns:
            print(f"🗑️ Удаляю {file} — нет колонки 'Ингредиенты'")
            os.remove(file)
            continue

        # Проверяем, есть ли непустые значения
        non_empty = df["Ингредиенты"].dropna()
        non_empty = non_empty[non_empty.astype(str).str.strip() != ""]  # убираем пустые строки

        if non_empty.empty:
            print(f"Удаляю {file} — колонка 'Ингредиенты' пуста")
            os.remove(file)
            continue

        for em in non_empty:
            if mapping[em] in unique_values:
                unique_values[mapping[em]] += 1
            else:
                unique_values[mapping[em]] = 1

    return unique_values


feed_types = {
    "01": "сенаж",
    "02": "силос",
    "03": "сено",
    "04": "солома",
    "05": "концентраты",
    "06": "зерно",
    "07": "корнаж",
    "08": "сенаж в пленке"
}

cultures = {
    "01": "люцерна",
    "02": "эспарцет",
    "03": "многолетние травы",
    "04": "луговые травы",
    "05": "кукуруза",
    "06": "суданская трава",
    "07": "вико-овес",
    "08": "люцерна",
    "09": "клевер",
    "10": "однолетние травы",
    "11": "райграс",
    "12": "тритикале",
    "13": "рожь",
    "14": "клевер",
    "15": "пшеница",
    "16": "разнотравье",
    "17": "горох",
    "18": "зерносмесь",
    "19": "ячмень",
    "20": "шрот соевый",
    "21": "шрот рапсовый",
    "22": "жмых рапсовый",
    "23": "жмых льняной",
    "25": "барда",
    "26": "шрот подсолнечный",
    "27": "глютен",
    "28": "могар",
    "29": "амарант",
    "30": "сорго",
    "31": "козлятник",
    "32": "овес",
    "33": "вика + тритикале",
    "34": "рожь + тритикале",
    "35": "эспарцет + костер",
    "36": "овес + горох",
    "37": "кострец"
}

def advanced_change_mapping():
    pattern = re.compile(r'\d{4}\.\d{2}\.(\d{2})\.(\d{2})\.\d+\.\d{2}')

    new_mapping = {}

    for key, value in name_mapping.items():
        match = pattern.search(key)
        if match:
            culture_code = match.group(1)
            feed_code = match.group(2)
            culture_name = cultures.get(culture_code)
            feed_name = feed_types.get(feed_code)
            # создаем пару "культура - вид корма", если оба известны
            if culture_name and feed_name:
                new_mapping[key] = f"{culture_name} - {feed_name}"
            else:
                new_mapping[key] = value
        else:
            new_mapping[key] = value

    return new_mapping

def change_mapping():
    pattern = re.compile(r'\d{4}\.\d{2}\.(\d{2})\.\d{2}\.\d+\.\d{2}')

    new_mapping = {}

    for key, value in name_mapping.items():
        match = pattern.search(key)
        if match:
            culture_code = match.group(1)
            culture_name = cultures.get(culture_code)
            if culture_name and value in feed_types.values():
                new_mapping[key] = culture_name
            else:
                new_mapping[key] = value
        else:
            new_mapping[key] = value

    return new_mapping

def check_analize():
    folder_path = "parsed_data/step_analize"
    unique_values = set()

    for filename in os.listdir(folder_path):
        if filename.endswith('.csv'):
            file_path = os.path.join(folder_path, filename)
            try:
                df = pd.read_csv(file_path, sep="|", header=None)
                if not df.empty:
                    first_col = df.columns[0]
                    unique_values.update(df[first_col].dropna().unique())
            except Exception as e:
                print(f"Ошибка при обработке {filename}: {e}")

    print(list(unique_values))
    return sorted(unique_values)


if __name__ == "__main__":
    #new_mapping = change_mapping()
    #unique_list = get_unique_ration_elems(new_mapping)

    unique_list = get_unique_ration_elems(name_mapping)

    print(unique_list.keys())
    print("\nУникальные значения признака 'Ингредиенты':")
    for val in unique_list.items():
        print(val)

    print("\nОбщее количество уникальных значений:", len(unique_list))

    print(len(check_analize()))
