import numpy as np

medians_of_data = {
    'кукуруза': np.float64(44.0),
    'ячмень': np.float64(0.0),
    'лен': np.float64(0.0),
    'соя': np.float64(11.6),
    'концентраты': np.float64(1.19),
    'свекла': np.float64(7.08),
    'суданская трава': np.float64(0.0),
    'зерносмесь': np.float64(0.0),
    'солома': np.float64(0.0),
    'луговые травы': np.float64(0.0),
    'люцерна': np.float64(8.8),
    'комбикорм': np.float64(10.4),
    'рапс': np.float64(7.2),
    'однолетние травы': np.float64(0.0),
    'многолетние травы': np.float64(0.0),
    'пшеница': np.float64(0.0),
    'тритикале': np.float64(0.0),
    'эспарцет': np.float64(0.0),
    'сенаж': np.float64(0.0),
    'корнаж': np.float64(0.0),
    'клевер': np.float64(0.0),
    'сено': np.float64(0.0),
    'разнотравье': np.float64(0.0),
    'подсолнечник': np.float64(0.0),
    'сорго': np.float64(0.0),
    'силос': np.float64(0.0),
    'рожь': np.float64(0.0),
    'K (%)': np.float64(1.5184),
    'aNDFom фуража (%)': np.float64(17.227),
    'СЖ (%)': np.float64(4.2731),
    'Растворимая клетчатка (%)': np.float64(6.43),
    'Крахмал (%)': np.float64(26.8935),
    'peNDF (%)': np.float64(16.5848),
    'aNDFom (%)': np.float64(26.8004),
    'ЧЭЛ 3x NRC (МДжоуль/кг)': np.float64(0.0),
    'Сахар (ВРУ) (%)': np.float64(7.18),
    'ОЖК (%)': np.float64(3.5543),
    'НВУ (%)': np.float64(44.0383),
    'CHO C uNDF (%)': np.float64(6.6572),
    'СП (%)': np.float64(16.79)
}

for_dropping = [
     "CHO B3 медленная фракция (%)",
     "CHO B3 pdNDF (%)",
     "НСУ (%)",
     "RD Крахмал 3xУровень 1 (%)"
]

main_acids = [
    "Лауриновая",
    "Олеиновая",
    "Пальмитиновая",
    "Стеариновая"
]

acids = [
    "Лауриновая",
    "Линолевая",
    "Олеиновая",
    "Пальмитиновая",
    "Стеариновая"
]

nutri = {
    0: 'K (%)',
    1 : 'aNDFom фуража (%)',
    2 : 'СЖ (%)',
    3 : 'Растворимая клетчатка (%)',
    4 : 'Крахмал (%)',
    5 : 'peNDF (%)',
    6 : 'aNDFom (%)',
    7 : 'ЧЭЛ 3x NRC (МДжоуль/кг)',
    8 : 'Сахар (ВРУ) (%)',
    9 : 'ОЖК (%)',
    10 : 'НВУ (%)',
    11 : 'CHO C uNDF (%)',
    12 : 'СП (%)'
}

nutri_for_predict = ['K (%)',
             'aNDFom фуража (%)',
             'СЖ (%)',
             'Растворимая клетчатка (%)',
             'Крахмал (%)',
             'peNDF (%)',
             'aNDFom (%)',
             'ЧЭЛ 3x NRC (МДжоуль/кг)',
             'Сахар (ВРУ) (%)',
             'ОЖК (%)',
             'НВУ (%)',
             'CHO C uNDF (%)',
             'СП (%)',
]

borders = {
    "Лауриновая" : [2.0, 4.4],
    "Линолевая" : [2.2, 5.0],
    "Олеиновая" : [20.0, 28.0],
    "Пальмитиновая" : [21.0, 32.0],
    "Стеариновая" : [8.0, 13.5]
}